# След успешно класиране, група заминава за  финалното състезание. След представянето си всяка
# група получава парична награда. Тя зависи от: държавата, в която се е провело състезанието;
# броя точки, които журито е дало и сезонът, през който се е провело състезанието.
# •	Ако състезанието се е провело в България паричната награда се изчислява като се умножат точките по броя участниците.
# •	Ако се е провело в чужбина – се умножават броя участници по броя точки и към тях се добавя 50% от получената сума.
# От получената сума се изваждат разходите посочени в проценти спрямо сезона, през който се е провел:
# 	Лято	Зима
# България	5%	8%
# Чужбина	10%	15%
# След завръщането си групата дарява 75% от сумата, след приспаднатите разходи, за благотворителност.
# Останалата сума се разпределя между членовете на групата.
# Да се  напише програма, която изчислява колко пари са дадени за благотворителност
# и колко е получил всеки един член на групата.
# От конзолата се четат 4 реда:
# 1.	Брой танцьори – цяло число в интервала [1 … 10]
# 2.	Брой точки – реално число в интервала [1.00 … 10000.00]
# 3.	Сезон –  текст със следните възможности - "summer" или "winter"
# 4.	Място – текст със следните възможности - "Bulgaria" или "Abroad"
# На конзолата се отпечатват 2 реда:
# •	Сумата, която са дали за благотворителност
# "Charity - {сума за благотворителност}"
# •	Сумата, която е получил всеки танцьор
# "Money per dancer - {сума за танцьор}"
# Сумите да бъдат форматирани до втория знак след десетичната запетая.


dancer = int(input())
points = float(input())
season = input()
place = input()

if place == "Bulgaria":
    total_amount = dancer * points
    if season == "summer":
        total_amount -= total_amount * 0.05
    if season == "winter":
        total_amount -= total_amount * 0.08

if place == "Abroad":
    total_amount = dancer * points + (dancer * points) * 0.5
    if season == "summer":
        total_amount -= total_amount * 0.10
    if season == "winter":
        total_amount -= total_amount * 0.15



charity_amount = total_amount * 0.75
money_per_dancer = (total_amount - charity_amount) / dancer

print(f"Charity - {charity_amount:.2f}")
print(f"Money per dancer - {money_per_dancer:.2f}")


